betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_sdmmc.h
#define IS_SDIO_CPSM(CPSM) (((CPSM) == SDIO_CPSM_DISABLE) || \
                                    ((CPSM) == SDIO_CPSM_ENABLE))
/**
  * @}
  */  

/** @defgroup SDIO_DDL_Response_Registers Response Register
  * @{
  */
#define SDIO_RES1                          0x00000000U
#define SDIO_RES2                          0x00000004U
#define SDIO_RES3                          0x00000008U
#define SDIO_RES4                          0x0000000CU

#define IS_SDIO_RESP(RESP) (((RESP) == SDIO_RES1) || \
                                    ((RESP) == SDIO_RES2) || \
                                    ((RESP) == SDIO_RES3) || \
                                    ((RESP) == SDIO_RES4))
/**
  * @}
  */

/** @defgroup SDIO_DDL_Data_Length Data Length
  * @{
  */
#define IS_SDIO_DATA_LENGTH(LENGTH) ((LENGTH) <= 0x01FFFFFFU)
/**
  * @}
  */

/** @defgroup SDIO_DDL_Data_Block_Size  Data Block Size
  * @{
  */
#define SDIO_DATABLOCK_SIZE_1B               0x00000000U
#define SDIO_DATABLOCK_SIZE_2B               SDIO_DCTRL_DBSIZE_0
#define SDIO_DATABLOCK_SIZE_4B               SDIO_DCTRL_DBSIZE_1
#define SDIO_DATABLOCK_SIZE_8B               (SDIO_DCTRL_DBSIZE_0|SDIO_DCTRL_DBSIZE_1)
#define SDIO_DATABLOCK_SIZE_16B              SDIO_DCTRL_DBSIZE_2
#define SDIO_DATABLOCK_SIZE_32B              (SDIO_DCTRL_DBSIZE_0|SDIO_DCTRL_DBSIZE_2)
#define SDIO_DATABLOCK_SIZE_64B              (SDIO_DCTRL_DBSIZE_1|SDIO_DCTRL_DBSIZE_2)
#define SDIO_DATABLOCK_SIZE_128B             (SDIO_DCTRL_DBSIZE_0|SDIO_DCTRL_DBSIZE_1|SDIO_DCTRL_DBSIZE_2)
#define SDIO_DATABLOCK_SIZE_256B             SDIO_DCTRL_DBSIZE_3
#define SDIO_DATABLOCK_SIZE_512B             (SDIO_DCTRL_DBSIZE_0|SDIO_DCTRL_DBSIZE_3)
#define SDIO_DATABLOCK_SIZE_1024B            (SDIO_DCTRL_DBSIZE_1|SDIO_DCTRL_DBSIZE_3)
#define SDIO_DATABLOCK_SIZE_2048B            (SDIO_DCTRL_DBSIZE_0|SDIO_DCTRL_DBSIZE_1|SDIO_DCTRL_DBSIZE_3) 
#define SDIO_DATABLOCK_SIZE_4096B            (SDIO_DCTRL_DBSIZE_2|SDIO_DCTRL_DBSIZE_3)
#define SDIO_DATABLOCK_SIZE_8192B            (SDIO_DCTRL_DBSIZE_0|SDIO_DCTRL_DBSIZE_2|SDIO_DCTRL_DBSIZE_3)
#define SDIO_DATABLOCK_SIZE_16384B           (SDIO_DCTRL_DBSIZE_1|SDIO_DCTRL_DBSIZE_2|SDIO_DCTRL_DBSIZE_3)

#define IS_SDIO_BLOCK_SIZE(SIZE) (((SIZE) == SDIO_DATABLOCK_SIZE_1B)    || \
                                          ((SIZE) == SDIO_DATABLOCK_SIZE_2B)    || \
                                          ((SIZE) == SDIO_DATABLOCK_SIZE_4B)    || \
                                          ((SIZE) == SDIO_DATABLOCK_SIZE_8B)    || \
                                          ((SIZE) == SDIO_DATABLOCK_SIZE_16B)   || \
                                          ((SIZE) == SDIO_DATABLOCK_SIZE_32B)   || \
                                          ((SIZE) == SDIO_DATABLOCK_SIZE_64B)   || \
                                          ((SIZE) == SDIO_DATABLOCK_SIZE_128B)  || \
                                          ((SIZE) == SDIO_DATABLOCK_SIZE_256B)  || \
                                          ((SIZE) == SDIO_DATABLOCK_SIZE_512B)  || \
                                          ((SIZE) == SDIO_DATABLOCK_SIZE_1024B) || \
                                          ((SIZE) == SDIO_DATABLOCK_SIZE_2048B) || \
                                          ((SIZE) == SDIO_DATABLOCK_SIZE_4096B) || \
                                          ((SIZE) == SDIO_DATABLOCK_SIZE_8192B) || \
                                          ((SIZE) == SDIO_DATABLOCK_SIZE_16384B)) 
/**
  * @}
  */

/** @defgroup SDIO_DDL_Transfer_Direction Transfer Direction
  * @{
  */
#define SDIO_TRANSFER_DIR_TO_CARD            0x00000000U
#define SDIO_TRANSFER_DIR_TO_SDIO    SDIO_DCTRL_DTDRCFG

#define IS_SDIO_TRANSFER_DIR(DIR) (((DIR) == SDIO_TRANSFER_DIR_TO_CARD) || \
                                           ((DIR) == SDIO_TRANSFER_DIR_TO_SDIO))
/**
  * @}
  */

/** @defgroup SDIO_DDL_Transfer_Type Transfer Type
  * @{
  */
#define SDIO_TRANSFER_MODE_BLOCK             0x00000000U
#define SDIO_TRANSFER_MODE_STREAM            SDIO_DCTRL_DTSEL

#define IS_SDIO_TRANSFER_MODE(MODE) (((MODE) == SDIO_TRANSFER_MODE_BLOCK) || \
                                             ((MODE) == SDIO_TRANSFER_MODE_STREAM))
/**
  * @}
  */

/** @defgroup SDIO_DDL_DPSM_State DPSM State
  * @{
  */
#define SDIO_DPSM_DISABLE                    0x00000000U
#define SDIO_DPSM_ENABLE                     SDIO_DCTRL_DTEN

#define IS_SDIO_DPSM(DPSM) (((DPSM) == SDIO_DPSM_DISABLE) ||\
                                    ((DPSM) == SDIO_DPSM_ENABLE))
/**
  * @}
  */
  
/** @defgroup SDIO_DDL_Read_Wait_Mode Read Wait Mode
  * @{
  */
#define SDIO_READ_WAIT_MODE_DATA2                0x00000000U
#define SDIO_READ_WAIT_MODE_CLK                  (SDIO_DCTRL_RDWAIT)

#define IS_SDIO_READWAIT_MODE(MODE) (((MODE) == SDIO_READ_WAIT_MODE_CLK) || \
                                             ((MODE) == SDIO_READ_WAIT_MODE_DATA2))
/**
  * @}
  */  

/** @defgroup SDIO_DDL_Interrupt_sources Interrupt Sources
  * @{
  */
#define SDIO_IT_CCRCFAIL                    SDIO_MASK_CCRCFAIL
#define SDIO_IT_DCRCFAIL                    SDIO_MASK_DCRCFAIL
#define SDIO_IT_CTIMEOUT                    SDIO_MASK_CMDTO
#define SDIO_IT_DTIMEOUT                    SDIO_MASK_DATATO
#define SDIO_IT_TXUNDERR                    SDIO_MASK_TXURER
#define SDIO_IT_RXOVERR                     SDIO_MASK_RXORER
#define SDIO_IT_CMDREND                     SDIO_MASK_CMDRESRC
#define SDIO_IT_CMDSENT                     SDIO_MASK_CMDSENT
#define SDIO_IT_DATAEND                     SDIO_MASK_DATAEND
#if defined(SDIO_STS_SBE)
#define SDIO_IT_STBITERR                    SDIO_MASK_STRTER
#endif
#define SDIO_IT_DBCKEND                     SDIO_MASK_DBEND
#define SDIO_IT_CMDACT                      SDIO_MASK_CMDACT
#define SDIO_IT_TXACT                       SDIO_MASK_TXACT
#define SDIO_IT_RXACT                       SDIO_MASK_RXACT
#define SDIO_IT_TXFIFOHE                    SDIO_MASK_TXHFERT
#define SDIO_IT_RXFIFOHF                    SDIO_MASK_RXHFFUL
#define SDIO_IT_TXFIFOF                     SDIO_MASK_TXFUL
#define SDIO_IT_RXFIFOF                     SDIO_MASK_RXFUL
#define SDIO_IT_TXFIFOE                     SDIO_MASK_TXEPT
#define SDIO_IT_RXFIFOE                     SDIO_MASK_RXFEIE
#define SDIO_IT_TXDAVL                      SDIO_MASK_TXDAVB
#define SDIO_IT_RXDAVL                      SDIO_MASK_RXDAVB
#define SDIO_IT_SDIOIT                      SDIO_MASK_SDIOINTREC
#if defined(SDIO_CMD_ATACMD)
#define SDIO_IT_CEATAEND                    SDIO_MASK_ATACLPREC
#endif
/**
  * @}
  */ 

